src/Catalogs/Scan_ОпцииПродуктов/Scan_ОпцииПродуктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ОпцииПродуктов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БазовыеОпции</name>
      <description>Базовые</description>
    </items>
    <items>
      <name>SOrderОпции</name>
      <description>S-order</description>
    </items>
    <items>
      <name>FFUОпции</name>
      <description>FFU</description>
    </items>
    <items>
      <name>ЛокальныеОпции</name>
      <description>Локальные опции</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВСпецификации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяНаРынкеРФ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяОпция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОпции</name>
    <type>
      <types>CatalogRef.Scan_ТипыОпций</types>
    </type>
  </attributes>
  <attributes>
    <name>RefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникRefCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукта</name>
    <type>
      <types>CatalogRef.Scan_ВидыПродуктов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Scan_ОпцииПродуктов/Forms/ФормаГруппы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Ссылка.Пустая() Тогда
		ТекстОшибки = Нстр("ru = 'Запрещено добавление элементов справочника!'; en = 'It is forbidden to add directory entries!'");		
		Сообщить(ТекстОшибки);
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --

&НаКлиенте
Процедура ПриОткрытии(Отказ) //rarus bonmak 08.10.2019 14177 ++
	Если Объект.Предопределенный Тогда		
		Элементы.Код.Видимость = Ложь;
		Элементы.НаименованиеАнглийское.Видимость = Ложь;
		Элементы.IDExternalSystem.Видимость = Ложь;
		Элементы.ДатаОбновления.Видимость = Ложь;
		Элементы.ИспользоватьВСпецификации.Видимость = Ложь;
		Элементы.ОсновнаяОпция.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры //rarus bonmak 08.10.2019 14177 --
